% Генерация NSSS по документации 3GPP
function subframeGrid = gen_NSSS(obj)
    subframeGrid = obj.subframeGrid;

    n = 0:131;
    n_ = mod(n,131);
    m = mod(n,128);
    u = mod(obj.parentFrame.parentGrid.Config.NCellID, 126) + 3;
    q = floor(obj.parentFrame.parentGrid.Config.NCellID./126);

    b = [1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1;
         1 -1 -1 1 -1 1 1 -1 -1 1 1 -1 1 -1 -1 1 -1 1 1 -1 1 -1 -1 1 1 -1 -1 1 -1 1 1 -1 1 -1 -1 1 -1 1 1 -1 -1 1 1 -1 1 -1 -1 1 -1 1 1 -1 1 -1 -1 1 1 -1 -1 1 -1 1 1 -1 1 -1 -1 1 -1 1 1 -1 -1 1 1 -1 1 -1 -1 1 -1 1 1 -1 1 -1 -1 1 1 -1 -1 1 -1 1 1 -1 1 -1 -1 1 -1 1 1 -1 -1 1 1 -1 1 -1 -1 1 -1 1 1 -1 1 -1 -1 1 1 -1 -1 1 -1 1 1 -1;
         1 -1 -1 1 -1 1 1 -1 -1 1 1 -1 1 -1 -1 1 -1 1 1 -1 1 -1 -1 1 1 -1 -1 1 -1 1 1 -1 -1 1 1 -1 1 -1 -1 1 1 -1 -1 1 -1 1 1 -1 1 -1 -1 1 -1 1 1 -1 -1 1 1 -1 1 -1 -1 1 1 -1 -1 1 -1 1 1 -1 -1 1 1 -1 1 -1 -1 1 -1 1 1 -1 1 -1 -1 1 1 -1 -1 1 -1 1 1 -1 -1 1 1 -1 1 -1 -1 1 1 -1 -1 1 -1 1 1 -1 1 -1 -1 1 -1 1 1 -1 -1 1 1 -1 1 -1 -1 1;
         1 -1 -1 1 -1 1 1 -1 -1 1 1 -1 1 -1 -1 1 -1 1 1 -1 1 -1 -1 1 1 -1 -1 1 -1 1 1 -1 -1 1 1 -1 1 -1 -1 1 1 -1 -1 1 -1 1 1 -1 1 -1 -1 1 -1 1 1 -1 -1 1 1 -1 1 -1 -1 1 -1 1 1 -1 1 -1 -1 1 1 -1 -1 1 -1 1 1 -1 1 -1 -1 1 -1 1 1 -1 -1 1 1 -1 1 -1 -1 1 1 -1 -1 1 -1 1 1 -1 -1 1 1 -1 1 -1 -1 1 -1 1 1 -1 1 -1 -1 1 1 -1 -1 1 -1 1 1 -1];

    d = b(q+1, m+1) .* exp(-1i.*2.*pi.*n) .* exp(-1i.*((pi.*u.*n_.*(n_+1))./(131)));
    d_ = [];

    % d - нужные значения в виде вектора. Далее мы преобразуем этот вектор
    % в матрицу для распределения значений по ресурсной сетке
    while ~isempty(d)
        cusochek = d(1:12)';
        d = d(13:end);
        d_ = [d_ cusochek];
    end
    
    % Добавление циклического сдвига, зависящего от frameID.
    cyclic_shift = mod((((33)./(132)).*((obj.parentFrame.frameID)./2)), 4);
    d__ = d_ .* exp(cyclic_shift);


    % Заполнение ресурсной сетки
    for subcarrier_index = 1:obj.totalSubcarriers
        subframeGrid(subcarrier_index, 4:14, 2) = 4;    % в сетке для "раскрашивания" NPSS - 4
        subframeGrid(subcarrier_index, 4:14, 1) = d__(subcarrier_index, :);
    end      
end